# MepReheatHotwaterLoop Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..MepReheatHotwaterLoop Property
ParameterTypeId Class See Also
---
"Reheat Hot Water Loop"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId MepReheatHotwaterLoop { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property MepReheatHotwaterLoop As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ MepReheatHotwaterLoop {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace